# Grouping data

### Шаг 1. Импортируйте необходимые библиотеки

In [1]:
import pandas as pd

### Шаг 2. Создайте датафрейм со следующими значениями:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Шаг 3. Сохраните в перменную regiment.

In [3]:
regiment = pd.DataFrame(raw_data)

In [4]:
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Шаг 4. Какое среднее значение у пременной preTestScore в строках где значение regiment равно Nighthawks?

In [5]:
regiment.loc[regiment['regiment'] == 'Nighthawks']['preTestScore'].mean()

np.float64(15.25)

### Шаг 6. Какое значение preTestScore для каждой компании?

In [6]:
regiment.groupby('company')['preTestScore'].sum()

company
1st    40
2nd    93
Name: preTestScore, dtype: int64

### Шаг 7. Выведите средние значения preTestScores, сгруппированные по переменным regiment и company

In [7]:
s = regiment.groupby(['regiment', 'company'])['preTestScore'].mean()
s

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Шаг 8. Выведите средние значения preTestScores, сгруппированные по переменным regiment и company без иерархической индексации

In [9]:
regiment.groupby(['regiment', 'company'])['preTestScore'].mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Шаг 9. Сгруппируйте датафрейм по переменным regiment и company

In [12]:
grouped = regiment.groupby(['regiment', 'company']).sum()
grouped

                              name  preTestScore  postTestScore
regiment   company
Dragoons   1st          CoozeJacon             7             95
           2nd          RyanerSone            55            151
Nighthawks 1st      MillerJacobson            28            119
           2nd           AliMilner            33            119
Scouts     1st          SloanPiger             5            132
           2nd            RianiAli             5            132

### Шаг 10. Сколько наблюдений для каждого уникального значения переменных regiment и company

In [16]:
regiment.groupby(['company', 'regiment']).nunique()

                    name  preTestScore  postTestScore
company regiment
1st     Dragoons       2             2              2
        Nighthawks     2             2              2
        Scouts         2             2              2
2nd     Dragoons       2             2              2
        Nighthawks     2             2              2
        Scouts         2             2              2

### Шаг 11. Сгруппируйте данные по переменной regiment, проитерируйтесь по группе и выведите название и информацию в каждой группе

In [11]:
regiment.groupby('regiment').apply(lambda gr: print(gr.name, gr))

Dragoons    regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks      regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts    regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

C:\Users\janep\AppData\Local\Temp\ipykernel_15404\167085984.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  regiment.groupby('regiment').apply(lambda gr: print(gr.name, gr))

Empty DataFrame
Columns: []
Index: []